swat-4-dp/src/main/soma/hsm-clone-kwk-step-2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dp="http://www.datapower.com/schemas/management">
    <soapenv:Body>
        <dp:request domain="default" xmlns:dp="http://www.datapower.com/schemas/management">
            <dp:do-action>
                <HSMCloneKWK>
                    <InputFilename>temporary:///source-one.kwk</InputFilename>
                    <OutputFilename>destination-two.kwk</OutputFilename>
                </HSMCloneKWK>
            </dp:do-action>
        </dp:request>
    </soapenv:Body>
</soapenv:Envelope>
